БПКР/src/AccumulationRegisters/ВозвратыТоваров/ВозвратыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВозвратыТоваров</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ДвижениеМБП</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БПКР/src/AccumulationRegisters/ВозвратыТоваров/RecordSetModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ ИЛИ Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Движение Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Движение.Сделка)
			И Движение.Сделка <> Неопределено Тогда
			
			Движение.Сделка = Неопределено;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Движение.Партия)
			И Движение.Партия <> Неопределено Тогда
			
			Движение.Партия = Неопределено;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли
